Revit 2026 API

# SteelElementProperties Methods

---

The SteelElementProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddFabricationInformationForRevitElements |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetReference | This method will return the reference for the given fabrication id. |
|  | GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace